## Running Total/Cumulative Total

In [6]:
import pandas as pd
import sqlite3
import sql
sql.style = 'plain'
%load_ext sql
connection=sqlite3.connect("question_bank.db")
print("Successfully connected to SQL database")
# Connect to SQLite
%sql sqlite:///question_bank.db
print("success")

The sql extension is already loaded. To reload it, use:
  %reload_ext sql
Successfully connected to SQL database
success

In [7]:
%%sql
-- Create the Payments table
CREATE TABLE Payments (
    employee_id INTEGER,
    pay_date DATE,
    amount INTEGER
);

-- Insert sample data
INSERT INTO Payments (employee_id, pay_date, amount) VALUES
(1, '2024-01-01', 3000),
(1, '2024-02-01', 3200),
(1, '2024-03-01', 3100),
(2, '2024-01-15', 4000),
(2, '2024-02-15', 4100),
(3, '2024-01-10', 3500);

 * sqlite:///question_bank.db
(sqlite3.OperationalError) table Payments already exists
[SQL: -- Create the Payments table
CREATE TABLE Payments (
    employee_id INTEGER,
    pay_date DATE,
    amount INTEGER
);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [8]:
%%sql
SELECT * FROM Payments

 * sqlite:///question_bank.db
Done.

[(1, '2024-01-01', 3000),
 (1, '2024-02-01', 3200),
 (1, '2024-03-01', 3100),
 (2, '2024-01-15', 4000),
 (2, '2024-02-15', 4100),
 (3, '2024-01-10', 3500)]

In [9]:
%%sql

-- calculate running total (cumulative sum) of salary payments for each employee over time 

-- For each employee - GROUP BY emp_id
-- Cumulative sum = 30+32= 62+31=93+ and so on...
-- We use PARTITION BY instead of GROUP BY - to not lose information

SELECT employee_id,pay_date,amount,
SUM (amount) OVER (
    PARTITION BY employee_id                     -- Do this per employee (just like GROUP BY)
    ORDER BY pay_date                            -- In chronological Order
    ROWS BETWEEN UNBOUNDED PRECEDING             -- Start from the first row
        AND CURRENT ROW) AS Running_Total        -- Up to the current row

FROM Payments

 * sqlite:///question_bank.db
Done.

[(1, '2024-01-01', 3000, 3000),
 (1, '2024-02-01', 3200, 6200),
 (1, '2024-03-01', 3100, 9300),
 (2, '2024-01-15', 4000, 4000),
 (2, '2024-02-15', 4100, 8100),
 (3, '2024-01-10', 3500, 3500)]

In [10]:
%%sql
WITH Pay AS (SELECT employee_id,pay_date,amount,
            SUM (amount) OVER (
                PARTITION BY employee_id                     
                ORDER BY pay_date                            
                ROWS BETWEEN UNBOUNDED PRECEDING             
                    AND CURRENT ROW) AS Running_Total
        FROM Payments
) 
SELECT *
FROM Pay

 * sqlite:///question_bank.db
Done.

[(1, '2024-01-01', 3000, 3000),
 (1, '2024-02-01', 3200, 6200),
 (1, '2024-03-01', 3100, 9300),
 (2, '2024-01-15', 4000, 4000),
 (2, '2024-02-15', 4100, 8100),
 (3, '2024-01-10', 3500, 3500)]